[
  {
    "image":"https://cdn-icons-png.flaticon.com/128/733/733547.png",
    "title": "Facebook: The Social Network",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "Connect with friends, family, and people who share the same interests as you. Facebook helps you build and maintain relationships with the people who matter most, allowing you to share life updates, photos, and videos, and see what's new with others in your network.\n\nBeyond personal connections, Facebook is a gateway to discovering communities and growing businesses. Join Groups to discuss your hobbies and passions, explore Marketplace to buy and sell items locally, and follow your favorite brands, artists, and creators to stay updated. It's a comprehensive platform for your social and community life.",
    "size": 78,
    "reviews": "352K",
    "ratingAvg": 3.1,
    "downloads": "8000000000",
    "ratings": [
      { "name": "1 star", "count": 45123456 },
      { "name": "2 star", "count": 15000000 },
      { "name": "3 star", "count": 18000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 37000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/128/15707/15707749.png",
    "title": "Instagram: Photo & Video Sharing",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Instagram provides a simple, fun & creative way to capture, edit & share photos, videos & messages with friends & family. Express your visual story using a wide array of filters and creative tools to bring your moments to life. Dive into Reels to create and discover entertaining short videos, or share a highlight reel of your day with Stories.\n\nExplore your interests and connect with a global community. Follow your favorite creators, brands, and friends to see what they're up to, and discover new content on the Explore page tailored just for you. With direct messaging, you can chat privately, share posts, and connect on a more personal level.",
    "size": 52,
    "reviews": "587K",
    "ratingAvg": 4.4,
    "downloads": "1000000000",
    "ratings": [
      { "name": "1 star", "count": 12000000 },
      { "name": "2 star", "count": 5876543 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 28000000 },
      { "name": "5 star", "count": 90000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/WhatsApp.svg/240px-WhatsApp.svg.png",
    "title": "WhatsApp: Secure Messaging & Calls",
    "companyName": "WhatsApp LLC",
    "id": 3,
    "description": "WhatsApp Messenger is a FREE messaging and video calling app that is simple, reliable, and private. With end-to-end encryption, your personal messages and calls with friends and family are secured, meaning no one outside of your chats, not even WhatsApp, can read or listen to them.\n\nStay in touch with the groups of people that matter most, like your family or coworkers, with group chats. You can also share messages, photos, and videos with up to 256 people at once. Use Status to share text, photo, video, and GIF updates that disappear after 24 hours. WhatsApp works across mobile and desktop even on slow connections, with no subscription fees.",
    "size": 41,
    "reviews": "832K",
    "ratingAvg": 4.2,
    "downloads": "1000000000",
    "ratings": [
      { "name": "1 star", "count": 20321987 },
      { "name": "2 star", "count": 8000000 },
      { "name": "3 star", "count": 15000000 },
      { "name": "4 star", "count": 37000000 },
      { "name": "5 star", "count": 100000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/128/3621/3621471.png",
    "title": "TikTok: Short-Form Video Hub",
    "companyName": "TikTok Pte. Ltd.",
    "id": 4,
    "description": "TikTok is THE destination for mobile videos. On TikTok, short-form videos are exciting, spontaneous, and genuine. Whether you’re a sports fanatic, a pet enthusiast, or just looking for a laugh, there’s something for everyone. All you have to do is watch, engage with what you like, and skip what you don’t, and you’ll find an endless stream of short videos that feel personalized just for you.\n\nUnleash your creativity and become a creator with easy-to-use tools to capture and edit your daily moments. Add your favorite music or sound to your videos for free, and use special effects, filters, and AR objects to take your content to the next level. Discover new trends, join conversations, and share your unique voice with a global audience.",
    "size": 95,
    "reviews": "554K",
    "ratingAvg": 4.6,
    "downloads": "1000000000",
    "ratings": [
      { "name": "1 star", "count": 3432109 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 36000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/X_logo_2023.svg/240px-X_logo_2023.svg.png",
    "title": "X: Real-time News & Conversations",
    "companyName": "X Corp.",
    "id": 5,
    "description": "X is the everything app where you can see what's happening in the world right now. From breaking news and entertainment to sports, politics, and everyday interests, it’s the go-to source for real-time information and public conversation. See all sides of the story and join the conversation to share your opinion.\n\nFollow your interests and connect with people from around the globe. You can follow thought leaders, journalists, and friends to get their updates in your timeline. With features like Spaces for live audio conversations and Communities for topic-based discussions, X offers multiple ways to engage, discuss, and stay informed.",
    "size": 65,
    "reviews": "345K",
    "ratingAvg": 4.3,
    "downloads": "200000000",
    "ratings": [
      { "name": "1 star", "count": 2056789 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2400000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 13000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/c/c4/Snapchat_logo.svg/240px-Snapchat_logo.svg.png",
    "title": "Snapchat: Lenses, Filters & Stories",
    "companyName": "Snap Inc",
    "id": 6,
    "description": "Snapchat is the fastest way to share the moment! Express yourself with Lenses, Filters, Bitmoji and more. Snap a photo or video, add a caption or doodle, and send it to your best friends and family. The app opens right to the camera, so you can capture and share fleeting moments in seconds.\n\nStay in touch with friends through live messaging, or share your day with Group Stories. See where your friends are hanging out on the Snap Map, and explore live Stories from the community nearby or across the world. You can also watch exclusive Original Shows and discover content from top publishers and creators in the Discover section.",
    "size": 72,
    "reviews": "3210K",
    "ratingAvg": 4.2,
    "downloads": "3000000000",
    "ratings": [
      { "name": "1 star", "count": 4109876 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 18000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Spotify_icon.svg/240px-Spotify_icon.svg.png",
    "title": "Spotify: Your Music and Podcast Universe",
    "companyName": "Spotify AB",
    "id": 7,
    "description": "With Spotify, you can listen to the songs, playlists, podcasts, and artists you love. Discover new music and podcasts from a vast library of millions of tracks and episodes. Get personalized recommendations with playlists made just for you, like Discover Weekly and Release Radar, to find your next favorite song.\n\nBuild your own collection of music and podcasts by creating playlists for any mood or activity. Share your creations with friends and enjoy a seamless listening experience across your phone, tablet, desktop, and speakers. With a Premium subscription, you can download music to listen offline, enjoy ad-free music, and get unlimited skips.",
    "size": 38,
    "reviews": "789K",
    "ratingAvg": 4.5,
    "downloads": "4000000000",
    "ratings": [
      { "name": "1 star", "count": 1890123 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 18000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/128/732/732228.png",
    "title": "Netflix: Stream TV Shows & Movies",
    "companyName": "Netflix, Inc.",
    "id": 8,
    "description": "Looking for the most talked about TV shows and movies from around the world? They’re all on Netflix. We’ve got award-winning series, movies, documentaries, and stand-up specials. With the mobile app, you get Netflix while you travel, commute, or just take a break.\n\nWhat you’ll love about Netflix is its personalized experience. The more you watch, the better it gets at recommending TV shows and movies you’ll love. You can create up to five profiles for an account, giving different members of your household their own personalized experience. Plus, you can download titles to your mobile device and watch offline, wherever you are.",
    "size": 25,
    "reviews": "1567K",
    "ratingAvg": 4.4,
    "downloads": "5000000000",
    "ratings": [
      { "name": "1 star", "count": 1178901 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/YouTube_social_white_square_%282017%29.svg/240px-YouTube_social_white_square_%282017%29.svg.png",
    "title": "YouTube: Watch, Stream & Discover Videos",
    "companyName": "Google LLC",
    "id": 9,
    "description": "Watch, stream, and discover what the world is watching with the YouTube app. From the hottest music videos to what’s popular in gaming, fashion, beauty, news, learning and more, there’s a channel for everyone. Subscribe to channels you love, create your own content, and share with friends and the world.\n\nExplore brand new content, music, news and more with the official YouTube app for phones and tablets. Dive into Shorts for a new way to watch and create short, catchy videos. Engage with the community through comments and live streams, and take your content on the go by saving videos for offline viewing with YouTube Premium.",
    "size": 40,
    "reviews": "345K",
    "ratingAvg": 4.1,
    "downloads": "6000000000",
    "ratings": [
      { "name": "1 star", "count": 15456789 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 22000000 },
      { "name": "5 star", "count": 70000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/128/2335/2335353.png",
    "title": "Google Maps: Navigate Your World",
    "companyName": "Google LLC",
    "id": 10,
    "description": "Navigate your world faster and easier with Google Maps. Over 220 countries and territories mapped and hundreds of millions of businesses and places on the map. Get real-time GPS navigation, traffic, and transit info, and find the best routes whether you're driving, biking, or walking.\n\nGoogle Maps is more than just navigation; it's your guide to exploring what's around you. Discover local restaurants, events, and activities. Read reviews,'K' ratings, and view pictures of places to help you decide where to go. You can even create lists of your favorite places and share them with friends.",
    "size": 55,
    "reviews": "890K",
    "ratingAvg": 4.0,
    "downloads": "7000000000",
    "ratings": [
      { "name": "1 star", "count": 2401234 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/128/732/732200.png",
    "title": "Gmail: Secure & Smart Email",
    "companyName": "Google LLC",
    "id": 11,
    "description": "The official Gmail app brings the best of Gmail to your phone or tablet with robust security, real-time notifications, multiple account support, and search that works across all your mail. It's designed to keep your messages safe and help you stay organized, automatically blocking more than 99.9% of spam, phishing, and malware from reaching your inbox.\n\nExperience a smarter inbox that helps you stay on top of what's important. Get nudges to follow up on emails, use Smart Reply for quick responses, and organize your inbox by sorting social and promotional messages into categories. Gmail is tightly integrated with Google Meet and Calendar, making it easier to manage your schedule and connect with others.",
    "size": 30,
    "reviews": "101K",
    "ratingAvg": 4.3,
    "downloads": "8000000000",
    "ratings": [
      { "name": "1 star", "count": 923456 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 6000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/128/5969/5969323.png",
    "title": "Uber: Request a Reliable Ride",
    "companyName": "Uber Technologies, Inc.",
    "id": 12,
    "description": "Uber is a ridesharing app for fast, reliable rides in minutes—day or night. There’s no need to park or wait for a taxi or bus. With Uber, you just tap to request a ride, and it’s easy to pay with credit or cash in select cities. Whether you’re going to the airport or across town, there’s an Uber for every occasion.\n\nYour safety is a priority. Track your ride in real-time, see your driver's details, and share your trip status with loved ones so they know you've arrived safely. The app also allows you to see your price estimate upfront before you book. Beyond rides, you can also use services like Uber Eats to get food from your favorite local restaurants delivered right to your door.",
    "size": 85,
    "reviews": "234K",
    "ratingAvg": 4.2,
    "downloads": "9800000000",
    "ratings": [
      { "name": "1 star", "count": 1345678 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 6000000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/128/4494/4494585.png",
    "title": "Airbnb: Homes, Stays & Experiences",
    "companyName": "Airbnb, Inc.",
    "id": 13,
    "description": "Book homes, experiences, and places to go. Unforgettable travel experiences start with Airbnb. Find travel adventures and new places to go far away or near to you, and access vacation home rentals, new experiences, and places to visit all around the world. Choose from a wide variety of unique accommodations, from cozy cabins to stylish penthouses.\n\nBeyond places to stay, you can immerse yourself in local culture with Airbnb Experiences. These are activities led by local experts, whether it's a cooking class, a guided hike, or a workshop. The platform is built on trust, with host and guest reviews helping you make informed 'decisK' for a safe and enjoyable trip.",
    "size": 110,
    "reviews": "187K",
    "ratingAvg": 4.7,
    "downloads": "9800000000",
    "ratings": [
      { "name": "1 star", "count": 76543 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 350000 },
      { "name": "5 star", "count": 1300000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Amazon_icon.svg/240px-Amazon_icon.svg.png",
    "title": "Amazon Shopping: Deals & More",
    "companyName": "Amazon Mobile LLC",
    "id": 14,
    "description": "The Amazon Shopping app lets you shop millions of items, never miss a deal, and compare prices and reviews easily. Browse, search, view product details, read reviews,'K' purchase millions of products. Amazon ships to over 100 countries in as quickly as 3-5 days, making global shopping accessible from your fingertips.\n\nGet a seamless shopping experience with features like order tracking, one-click ordering, and access to your cart and wish lists across devices. With an Amazon Prime membership, you can enjoy benefits like fast, free shipping on eligible items, access to exclusive deals, and streaming of movies, TV shows, and music. Use your camera to scan barcodes and images to instantly compare prices and check availability.",
    "size": 60,
    "reviews": "765K",
    "ratingAvg": 4.5,
    "downloads": "750000000",
    "ratings": [
      { "name": "1 star", "count": 454321 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 5000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/LinkedIn_logo_initials.png/240px-LinkedIn_logo_initials.png",
    "title": "LinkedIn: Your Professional Network",
    "companyName": "LinkedIn",
    "id": 15,
    "description": "LinkedIn is the world's largest professional network, where you can find jobs, build your network, and connect with professionals. Create a professional profile that highlights your skills and experience, and use it as your online resume to showcase your career journey and achievements.\n\nStay up-to-date with the latest news and trends in your industry by following companies, influencers, and topics. Use the powerful job search tools to find relevant opportunities and apply with your LinkedIn profile. It's an essential tool for career growth, professional networking, and staying informed in your field.",
    "size": 48,
    "reviews": "345K",
    "ratingAvg": 4.4,
    "downloads": "7450000000",
    "ratings": [
      { "name": "1 star", "count": 256789 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Pinterest-logo.png/240px-Pinterest-logo.png",
    "title": "Pinterest: Discover Creative Ideas",
    "companyName": "Pinterest",
    "id": 16,
    "description": "Looking for creative ideas? Whether you’re planning your next big travel adventure, searching for home design concepts, or looking for fashion & fitness tips, Pinterest is your destination for inspiration. It's a visual discovery engine where you can find ideas like recipes, home and style inspiration, and more.\n\nExplore billions of Pins to discover possibilities for every part of your life. Save what you find to organized boards to keep your ideas neat and easy to find. You can also collaborate with friends by creating group boards to plan trips or projects together. With shoppable Pins, you can go from inspiration to action and buy the products you discover.",
    "size": 28,
    "reviews": "123K",
    "ratingAvg": 4.6,
    "downloads": "230000000",
    "ratings": [
      { "name": "1 star", "count": 634567 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 7700000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/128/2111/2111370.png",
    "title": "Discord: Your Place to Talk & Hang Out",
    "companyName": "Discord Inc.",
    "id": 17,
    "description": "Discord is your place to talk. Create a home for your communities and friends, where you can stay close and have fun over text, voice, and video. Whether you’re part of a school club, a gaming group, a worldwide art community, or just a handful of friends that want to spend time together, Discord makes it easy to talk every day and hang out more often.\n\nOrganize your conversations in topic-based channels within your server, making it easy to collaborate, share, or just talk about your day without clogging up a group chat. Drop into a voice channel when you’re free for high-quality audio chat. Share your screen, stream games, or watch videos together in a seamless, integrated environment.",
    "size": 75,
    "reviews": "567K",
    "ratingAvg": 4.5,
    "downloads": "2350000000",
    "ratings": [
      { "name": "1 star", "count": 378901 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 3700000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Telegram_logo.svg/240px-Telegram_logo.svg.png",
    "title": "Telegram: Fast & Secure Messaging",
    "companyName": "Telegram FZ-LLC",
    "id": 18,
    "description": "Telegram is pure instant messaging — simple, fast, secure, and synced across all your devices. With a focus on speed and security, it's one of the world's top 10 most downloaded apps with over 500 million active users. Your entire chat history will require no disk space on your device, and will be securely stored in the Telegram cloud for as long as you need it.\n\nBeyond basic messaging, Telegram supports massive group chats of up to 200,000 members, large video and document sharing of any type up to 2 GB each, and powerful channels for broadcasting to unlimited audiences. It provides a clean and minimalist interface while offering a powerful set of features for personal and professional communication.",
    "size": 33,
    "reviews": "145K",
    "ratingAvg": 4.4,
    "downloads": "1240000000",
    "ratings": [
      { "name": "1 star", "count": 1067890 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 9000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Microsoft_Office_Teams_%282018%E2%80%93present%29.svg/240px-Microsoft_Office_Teams_%282018%E2%80%93present%29.svg.png",
    "title": "Microsoft Teams: Collaborate & Meet",
    "companyName": "Microsoft Corporation",
    "id": 19,
    "description": "Whether you're working with teammates on a project or planning a weekend activity with loved ones, Microsoft Teams helps bring people together so that they can accomplish more. It's the one app to chat, meet, call, and collaborate all in one place, keeping your work, school, and personal life organized.\n\nBring your team together with high-quality video meetings, collaborative file editing, and persistent chat channels organized by topic. Teams is deeply integrated with Microsoft 365, allowing you to co-author Word docs, PowerPoint presentations, and Excel spreadsheets in real time. It's a powerful hub for teamwork that keeps everything and everyone in sync.",
    "size": 88,
    "reviews": "321K",
    "ratingAvg": 4.6,
    "downloads": "540000000",
    "ratings": [
      { "name": "1 star", "count": 110987 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 2200000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/128/5969/5969238.png",
    "title": "Zoom: One Platform to Connect",
    "companyName": "zoom.us",
    "id": 20,
    "description": "Work from anywhere with a single app that combines team chat, phone, whiteboard, meetings, and more. Zoom is renowned for its high-quality and reliable video meetings, making it easy to connect with colleagues, clients, and friends from any device. Host or join secure meetings with features like screen sharing, virtual backgrounds, and interactive tools.\n\nBeyond meetings, Zoom has evolved into a comprehensive communications platform. Use Team Chat for persistent messaging and file sharing to keep projects moving forward. Collaborate in real time with the virtual Whiteboard, and utilize Zoom Phone for a flexible cloud phone system. It brings all your communication and collaboration needs into one unified experience.",
    "size": 92,
    "reviews": "234K",
    "ratingAvg": 4.0,
    "downloads": "760000000",
    "ratings": [
      { "name": "1 star", "count": 345678 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 1200000 }
    ]
  }
]